doom.d/config.org
* ement matrix client
+BEGIN_SRC emacs-lisp
(use-package! ement
  :defer t
  )
+END_SRC

* mistty
#+BEGIN_SRC emacs-lisp
(use-package! mistty
  :defer t
  :config
  (setq explicit-shell-file-name "/usr/bin/fish")
  ;; (setq explicit-shell-file-name "/usr/bin/bash")
  )
#+END_SRC

* eat
+BEGIN_SRC emacs-lisp
;; For `eat-eshell-mode'.
(add-hook 'eshell-load-hook #'eat-eshell-mode)

;; For `eat-eshell-visual-command-mode'.
;; (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)
+END_SRC

* igist
#+BEGIN_SRC emacs-lisp
(use-package! igist
  :defer t
  :config
  (setq igist-current-user-name "johanwiden")
  (setq igist-auth-marker 'igist))
#+END_SRC

* tab-bar
#+BEGIN_SRC emacs-lisp
(add-to-list 'tab-bar-format #'tab-bar-format-menu-bar)
#+END_SRC

* casual: calc transient
#+BEGIN_SRC emacs-lisp
(use-package! casual
  :after calc
  :bind
    (:map calc-mode-map ("C-o" . casual-main-menu)))
#+END_SRC

* gptel
#+BEGIN_SRC emacs-lisp
(use-package! gptel
  :defer t
  :config
  (setq! gptel-api-key (secrets-get-secret "Login" "Password for 'OPENAI_API_KEY' on 'apikey'")))
#+END_SRC

* evil-matchit
#+BEGIN_SRC emacs-lisp
(use-package! evil-matchit
  ;; :defer t
  :config
  (global-evil-matchit-mode 1))
#+END_SRC

* activities
Inspired by Genera’s and KDE’s concepts of “activities”, this Emacs library allows the user to manage frames/tabs, windows, and buffers according to their purpose.
#+BEGIN_SRC emacs-lisp
(use-package! activities
  :init
  (activities-mode)
  (activities-tabs-mode)
  ;; Prevent `edebug' default bindings from interfering.
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list)))
#+END_SRC

* ace-window-one-command, ace-window-prefix
Temporarily select a window, and perform next command in it.
#+BEGIN_SRC emacs-lisp
(defun ace-window-one-command ()
  (interactive)
  (let ((win (aw-select " ACE")))
    (when (windowp win)
      (with-selected-window win
        (let* ((command (key-binding
                         (read-key-sequence
                          (format "Run in %s..." (buffer-name)))))
               (this-command command))
          (call-interactively command))))))

(keymap-global-set "C-x O" 'ace-window-one-command)

(defun ace-window-prefix ()
  "Use `ace-window' to display the buffer of the next command.
The next buffer is the buffer displayed by the next command invoked
immediately after this command (ignoring reading from the minibuffer).
Creates a new window before displaying the buffer.
When `switch-to-buffer-obey-display-actions' is non-nil,
`switch-to-buffer' commands are also supported."
  (interactive)
  (display-buffer-override-next-command
   (lambda (buffer _)
     (let (window type)
       (setq
        window (aw-select (propertize " ACE" 'face 'mode-line-highlight))
        type 'reuse)
       (cons window type)))
   nil "[ace-window]")
  (message "Use `ace-window' to display next command buffer..."))

(keymap-global-set "C-x 4 o" 'ace-window-prefix)
#+END_SRC

* jinx spell checker
#+BEGIN_SRC emacs-lisp
(use-package! jinx
  ;; :defer t
  :bind (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages))
  :config
  (dolist (hook '(text-mode-hook org-mode-hook prog-mode-hook conf-mode-hook))
    (add-hook hook #'jinx-mode)))
#+END_SRC

* casual-avy: avy transient
#+BEGIN_SRC emacs-lisp
(use-package! casual-avy
  ;; :after avy
  :bind ("C-c g" . casual-avy-tmenu))
#+END_SRC
