doom.d/config.el

(use-package! ement
  :defer t
  )

(use-package! mistty
  :defer t
  :config
  (setq explicit-shell-file-name "/usr/bin/fish")
  ;; (setq explicit-shell-file-name "/usr/bin/bash")
  )

;; For `eat-eshell-mode'.
(add-hook 'eshell-load-hook #'eat-eshell-mode)

;; For `eat-eshell-visual-command-mode'.
;; (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)

(use-package! igist
  :defer t
  :config
  (setq igist-current-user-name "johanwiden")
  (setq igist-auth-marker 'igist))

(add-to-list 'tab-bar-format #'tab-bar-format-menu-bar)
